export interface StageData {
  stage: number;
  materials: string[];
}

export interface RankData {
  rank: 'S' | 'A' | 'B';
  stages: StageData[];
}

export interface WeaponData {
  id: string;
  name: string;
  ranks: RankData[];
}

// ===== 單手劍 =====
export const oneHandSwordS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '釣竿', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '白色貓頭鷹胸針', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '灌木扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河電子吉他', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 橘子果醬', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 休閒套裝', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士盔甲', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族頭冠(男)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（女性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const oneHandSwordA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const oneHandSwordB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 雙手劍 =====
export const twoHandSwordS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '骰子', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '凱爾特十字架', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '岩石扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河大鼓', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 燉南瓜豬排', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 歐風淑女服長版型', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士手套', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族靴子(女)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（男性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const twoHandSwordA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const twoHandSwordB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 單手斧 =====
export const oneHandAxeS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '釣竿', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '白色貓頭鷹胸針', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '灌木扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河電子吉他', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 橘子果醬', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 休閒套裝', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士盔甲', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族頭冠(男)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（女性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const oneHandAxeA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const oneHandAxeB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 雙手斧 =====
export const twoHandAxeS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '骰子', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '凱爾特十字架', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '岩石扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河大鼓', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 燉南瓜豬排', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 歐風淑女服長版型', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士手套', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族靴子(女)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（男性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const twoHandAxeA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const twoHandAxeB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 單手鈍器 =====
export const oneHandBluntS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '釣竿', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '白色貓頭鷹胸針', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '灌木扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河電子吉他', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 橘子果醬', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 休閒套裝', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士盔甲', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族頭冠(男)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（女性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const oneHandBluntA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const oneHandBluntB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 雙手鈍器 =====
export const twoHandBluntS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '骰子', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '凱爾特十字架', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '岩石扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河大鼓', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 燉南瓜豬排', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 歐風淑女服長版型', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士手套', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族靴子(女)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（男性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const twoHandBluntA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const twoHandBluntB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 騎槍 =====
export const lanceS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '釣竿', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '凱爾特十字架', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '岩石扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河大鼓', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 燉南瓜豬排', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 歐風淑女服長版型', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士手套', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族靴子(女)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（男性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const lanceA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const lanceB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 擲矛器 =====
export const javelinS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '釣竿', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '白色貓頭鷹胸針', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '灌木扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河電子吉他', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 橘子果醬', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 休閒套裝', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士盔甲', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族頭冠(男)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（女性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const javelinA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const javelinB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 拳套 =====
export const knuckleS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '裁縫工具箱', '單手劍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '護身符', 'R1階段以上 單手斧'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '樹木扮裝工具', 'R1階段以上 單手鈍器'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河電子吉他', 'R2階段以上 雙手斧'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 蛤蜊鮮貝義大利麵', 'R2階段以上 拳套'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '藍色尖刺枷鎖 5個', '標示製作者的 透明燕尾服', 'R3階段以上 惡魔孤寂拳套'] },
  { stage: 7, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 德斯丁銀騎士金屬靴子', 'R4階段以上 凱爾特皇家鬥斧'] },
  { stage: 8, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族頭冠(女)', 'R5階段以上 凱爾特皇家戰錘'] },
  { stage: 9, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 巴貝斯巴勒殺手鎧甲（女性用）', 'R6階段以上 凱爾特利刃拳套'] },
];

export const knuckleA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手斧'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '極光的結晶 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 闊劍'] },
];

export const knuckleB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '單手劍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手斧'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '單手鈍器'] },
  { stage: 8, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '雙手斧'] },
  { stage: 9, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 弓 =====
export const bowS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '訓練棍子', '弓'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '環型飾品', 'S1階段以上 單手魔杖'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '立燈', 'S1階段以上 集魔杖'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河鈸', 'S2階段以上 鋼瓶'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 奶油烤龍蝦', 'S2階段以上 集魔杖'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 女性用劍士學校制服短型', 'S3階段以上 惡魔深淵鋼瓶'] },
  { stage: 7, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 伯納姆平板盔甲', 'S4階段以上 凱爾特三矛魔杖'] },
  { stage: 8, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族盔甲(男)', 'S5階段以上 凱爾特守護魔杖'] },
  { stage: 9, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（男性用）', 'S6階段以上 凱爾特四屬性鋼瓶'] },
];

export const bowA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 8個', '祝福藥水 1個', '銀色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 短弓'] },
];

export const bowB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '集魔杖'] },
  { stage: 8, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '鋼瓶'] },
  { stage: 9, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 弩 =====
export const crossbowS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '訓練棍子', '弓'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '環型飾品', 'S1階段以上 單手魔杖'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '立燈', 'S1階段以上 集魔杖'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河鈸', 'S2階段以上 鋼瓶'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 奶油烤龍蝦', 'S2階段以上 集魔杖'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 女性用劍士學校制服短型', 'S3階段以上 惡魔深淵鋼瓶'] },
  { stage: 7, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 伯納姆平板盔甲', 'S4階段以上 凱爾特三矛魔杖'] },
  { stage: 8, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族盔甲(男)', 'S5階段以上 凱爾特守護魔杖'] },
  { stage: 9, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（男性用）', 'S6階段以上 凱爾特四屬性鋼瓶'] },
];

export const crossbowA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 8個', '祝福藥水 1個', '銀色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 短弓'] },
];

export const crossbowB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '集魔杖'] },
  { stage: 8, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '鋼瓶'] },
  { stage: 9, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 單手魔杖 =====
export const oneHandWandS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '樂譜卷軸', '弓'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '生命之符', 'S1階段以上 單手魔杖'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '書桌', 'S1階段以上 集魔杖'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河口哨', 'S2階段以上 鋼瓶'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 鯖魚魚排', 'S2階段以上 集魔杖'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 波利樂舞裙', 'S3階段以上 惡魔深淵鋼瓶'] },
  { stage: 7, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 伯納姆平板手套', 'S4階段以上 凱爾特三矛魔杖'] },
  { stage: 8, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族盔甲(女)', 'S5階段以上 凱爾特守護魔杖'] },
  { stage: 9, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（男性用）', 'S6階段以上 凱爾特四屬性鋼瓶'] },
];

export const oneHandWandA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 8個', '祝福藥水 1個', '銀色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 短弓'] },
];

export const oneHandWandB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '集魔杖'] },
  { stage: 8, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '鋼瓶'] },
  { stage: 9, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 集魔杖 =====
export const staffS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '樂譜卷軸', '弓'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '生命之符', 'S1階段以上 單手魔杖'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '書桌', 'S1階段以上 集魔杖'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河口哨', 'S2階段以上 鋼瓶'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 鯖魚魚排', 'S2階段以上 集魔杖'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 波利樂舞裙', 'S3階段以上 惡魔深淵鋼瓶'] },
  { stage: 7, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 伯納姆平板手套', 'S4階段以上 凱爾特三矛魔杖'] },
  { stage: 8, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族盔甲(女)', 'S5階段以上 凱爾特守護魔杖'] },
  { stage: 9, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（男性用）', 'S6階段以上 凱爾特四屬性鋼瓶'] },
];

export const staffA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 8個', '祝福藥水 1個', '銀色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 短弓'] },
];

export const staffB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '集魔杖'] },
  { stage: 8, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '鋼瓶'] },
  { stage: 9, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 鋼瓶 =====
export const bottleS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '空瓶子', '弓'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '凱爾特十字架', 'S1階段以上 單手魔杖'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '木製鳥籠', 'S1階段以上 集魔杖'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河里拉琴', 'S2階段以上 鋼瓶'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 貝爾法斯特鰻魚蓋飯', 'S2階段以上 集魔杖'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 花邊層裙', 'S3階段以上 惡魔深淵鋼瓶'] },
  { stage: 7, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 伯納姆平板靴', 'S4階段以上 凱爾特三矛魔杖'] },
  { stage: 8, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族盔甲(男)', 'S5階段以上 凱爾特守護魔杖'] },
  { stage: 9, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（男性用）', 'S6階段以上 凱爾特四屬性鋼瓶'] },
];

export const bottleA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 8個', '祝福藥水 1個', '銀色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 短弓'] },
];

export const bottleB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '弓'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '單手魔杖'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '精製的催化劑 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '集魔杖'] },
  { stage: 8, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '鋼瓶'] },
  { stage: 9, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 手把 =====
export const handleS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '帶框眼鏡', '雙槍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '生命之符', 'R1階段以上 手裏劍'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '絲綢用織布機', 'R1階段以上 鎖鏈鐮刃'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河倫卡圖拉', 'R2階段以上 手把'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 花生奶油醬', 'R2階段以上 惡魔幻覺手把'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 伯尼塔絲綢迷你裙', 'R3階段以上 刺殺鎖鏈鐮刃'] },
  { stage: 7, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 泰晤士平板頭盔', 'R4階段以上 凱爾特塔烏拉 ZERO'] },
  { stage: 8, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族靴子(男)', 'R5階段以上 凱爾特手裏劍'] },
  { stage: 9, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（女性用）', 'R6階段以上 凱爾特誓約手把'] },
];

export const handleA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '手裏劍'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 雷德歐Ⅱ'] },
];

export const handleB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '手裏劍'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '失去光澤的金屬碎片 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '鎖鏈鐮刃'] },
  { stage: 8, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '人偶手把'] },
  { stage: 9, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 雙槍 =====
export const dualGunS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '苗條長袍', '雙槍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '白色貓頭鷹胸針', 'R1階段以上 手裏劍'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '優質皮繩用手紡車', 'R1階段以上 鎖鏈鐮刃'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河夏威夷四絃琴', 'R2階段以上 手把'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 炒青菜', 'R2階段以上 惡魔幻覺手把'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 時髦套裝', 'R3階段以上 刺殺鎖鏈鐮刃'] },
  { stage: 7, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 伯納姆平板頭盔', 'R4階段以上 凱爾特塔烏拉 ZERO'] },
  { stage: 8, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族盔甲(女)', 'R5階段以上 凱爾特手裏劍'] },
  { stage: 9, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（女性用）', 'R6階段以上 凱爾特誓約手把'] },
];

export const dualGunA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '手裏劍'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 雷德歐Ⅱ'] },
];

export const dualGunB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '手裏劍'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '失去光澤的金屬碎片 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '鎖鏈鐮刃'] },
  { stage: 8, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '人偶手把'] },
  { stage: 9, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 手裏劍 =====
export const shurikenS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '毛尾巴帽', '雙槍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '護身符', 'R1階段以上 手裏劍'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '高級皮繩用手紡車', 'R1階段以上 鎖鏈鐮刃'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河蕭姆管', 'R2階段以上 手把'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 魚與薄片', 'R2階段以上 惡魔幻覺手把'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 高級皮革盔甲', 'R3階段以上 刺殺鎖鏈鐮刃'] },
  { stage: 7, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 泰晤士平板盔甲', 'R4階段以上 凱爾特塔烏拉 ZERO'] },
  { stage: 8, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族手套(男)', 'R5階段以上 凱爾特手裏劍'] },
  { stage: 9, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（女性用）', 'R6階段以上 凱爾特誓約手把'] },
];

export const shurikenA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '手裏劍'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 雷德歐Ⅱ'] },
];

export const shurikenB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '手裏劍'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '失去光澤的金屬碎片 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '鎖鏈鐮刃'] },
  { stage: 8, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '人偶手把'] },
  { stage: 9, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

// ===== 鎖鏈鏈刃 =====
export const chainBladeS: StageData[] = [
  { stage: 1, materials: ['鐵塊 20個', '鐵板 5個', '神聖礦物碎片 3個', '古代的怪物核心 1個', '手工藝工具', '雙槍'] },
  { stage: 2, materials: ['金塊 20個', '金板 5個', '神聖礦物碎片 3個', '古代的怪物核心 3個', '環型飾品', 'R1階段以上 手裏劍'] },
  { stage: 3, materials: ['秘銀塊 20個', '秘銀板 5個', '神聖礦物碎片 3個', '古代的怪物核心 5個', '布料用織布機', 'R1階段以上 鎖鏈鐮刃'] },
  { stage: 4, materials: ['優質絲綢 10個', '優質布料 5個', '神聖礦物碎片 3個', '損壞的聖物殘骸 3個', '銀河大提琴', 'R2階段以上 手把'] },
  { stage: 5, materials: ['稀原合金 5個', '幸運的兔子腳', '神聖礦物碎片 3個', '損壞的聖物殘骸 5個', '5星 義大利海產細麵條', 'R2階段以上 惡魔幻覺手把'] },
  { stage: 6, materials: ['高級木柴 5個', '優質木柴 5個', '神聖礦物碎片 3個', '破碎的巨大甲殼 5個', '標示製作者的 可愛圍裙服', 'R3階段以上 刺殺鎖鏈鐮刃'] },
  { stage: 7, materials: ['木板 3個', '優質手製繃帶 10個', '神聖礦物碎片 3個', '腐敗的使徒皮革 5個', '標示製作者的 泰晤士平板手套', 'R4階段以上 凱爾特塔烏拉 ZERO'] },
  { stage: 8, materials: ['解毒藥水 5個', '中型生命與耐力藥水(效果50) 20個', '神聖礦物碎片 3個', '守護的啟示錄', '標示製作者的 巨人貴族手套(女)', 'R5階段以上 凱爾特手裏劍'] },
  { stage: 9, materials: ['粗線 5個', '優質皮繩 10個', '神聖礦物碎片 3個', '被淨化的使徒精髓', '標示製作者的 拉克里斯追逐者鎧甲（女性用）', 'R6階段以上 凱爾特誓約手把'] },
];

export const chainBladeA: StageData[] = [
  { stage: 1, materials: ['鐵塊 15個', '鐵板 5個', '高級皮繩 10個', '祝福藥水 1個', '銀色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 15個', '銅板 5個', '高級皮繩 10個', '祝福藥水 5個', '抱枕用棉花 1個', '中級皮革盔甲'] },
  { stage: 3, materials: ['銀塊 15個', '銀板 5個', '高級皮繩 10個', '祝福藥水 10個', '豬排', '火花皮甲'] },
  { stage: 4, materials: ['普通絲綢 10個', '普通布料 10個', '高級皮繩 10個', '再生粉末 5個', '銀色小珠子', '手裏劍'] },
  { stage: 5, materials: ['能量轉換器 5個', '完整的希里原 1個', '高級皮繩 10個', '再生粉末 10個', '乾草堆 1個', '魚骨盔甲(男性用)'] },
  { stage: 6, materials: ['中級木柴 15個', '高級木柴 15個', '高級皮繩 10個', '鬥魂的金屬碎片 5個', '4星 雞蛋壽司', '標示製作者的 普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 5個', '高級手製繃帶 10個', '高級皮繩 10個', '封印的黑色金屬 5個', '紙鶴 1000個', '標示製作者的 中級皮革盔甲'] },
  { stage: 8, materials: ['祝福藥水 5個', '中型魔法藥水(效果50) 15個', '高級皮繩 10個', '乾草堆 1個', '5星 燉蛋', '標示製作者的 火花皮甲'] },
  { stage: 9, materials: ['細線團 5個', '普通皮繩 10個', '高級皮繩 10個', '鐵棒 1個', '融合的稀原合金 1個', '標示製作者的 雷德歐Ⅱ'] },
];

export const chainBladeB: StageData[] = [
  { stage: 1, materials: ['鐵塊 10個', '鐵板 2個', '普通皮繩 8個', '祝福藥水 2個', '紅色小珠子', '雙槍'] },
  { stage: 2, materials: ['銅塊 10個', '銅板 2個', '普通皮繩 8個', '祝福藥水 6個', '釣竿', '皮頭巾'] },
  { stage: 3, materials: ['銀塊 10個', '銀板 2個', '普通皮繩 8個', '祝福藥水 10個', '水果拼盤', '火花皮甲'] },
  { stage: 4, materials: ['廉價絲綢 10個', '廉價布料 6個', '普通皮繩 8個', '精製的白色粉末 4個', '紅色小珠子', '手裏劍'] },
  { stage: 5, materials: ['六角螺絲 2個', '神秘的香草粉 2個', '普通皮繩 8個', '精製的白色粉末 6個', '輕便桌子', '舞蹈褲'] },
  { stage: 6, materials: ['木柴 10個', '中級木柴 10個', '普通皮繩 8個', '失去光澤的金屬碎片 2個', '蒸的玉米', '普通皮革盔甲'] },
  { stage: 7, materials: ['鐵塊 4個', '手製繃帶 2個', '普通皮繩 8個', '壞掉的環狀結構物 2個', '紙鶴 500個', '鎖鏈鐮刃'] },
  { stage: 8, materials: ['祝福藥水 2個', '中型魔法藥水(效果50) 10個', '普通皮繩 8個', '乾草堆 1個', '4星 起司醬', '人偶手把'] },
  { stage: 9, materials: ['粗線團 4個', '廉價皮繩 16個', '普通皮繩 8個', '鐵棒 1個', '黏黏的草 1個', '標示製作者的 皮頭巾'] },
];

export const weaponTypes: WeaponData[] = [
  {
    id: 'one-hand-sword',
    name: '單手劍',
    ranks: [
      { rank: 'S', stages: oneHandSwordS },
      { rank: 'A', stages: oneHandSwordA },
      { rank: 'B', stages: oneHandSwordB },
    ],
  },
  {
    id: 'two-hand-sword',
    name: '雙手劍',
    ranks: [
      { rank: 'S', stages: twoHandSwordS },
      { rank: 'A', stages: twoHandSwordA },
      { rank: 'B', stages: twoHandSwordB },
    ],
  },
  {
    id: 'one-hand-axe',
    name: '單手斧',
    ranks: [
      { rank: 'S', stages: oneHandAxeS },
      { rank: 'A', stages: oneHandAxeA },
      { rank: 'B', stages: oneHandAxeB },
    ],
  },
  {
    id: 'two-hand-axe',
    name: '雙手斧',
    ranks: [
      { rank: 'S', stages: twoHandAxeS },
      { rank: 'A', stages: twoHandAxeA },
      { rank: 'B', stages: twoHandAxeB },
    ],
  },
  {
    id: 'one-hand-blunt',
    name: '單手鈍器',
    ranks: [
      { rank: 'S', stages: oneHandBluntS },
      { rank: 'A', stages: oneHandBluntA },
      { rank: 'B', stages: oneHandBluntB },
    ],
  },
  {
    id: 'two-hand-blunt',
    name: '雙手鈍器',
    ranks: [
      { rank: 'S', stages: twoHandBluntS },
      { rank: 'A', stages: twoHandBluntA },
      { rank: 'B', stages: twoHandBluntB },
    ],
  },
  {
    id: 'lance',
    name: '騎槍',
    ranks: [
      { rank: 'S', stages: lanceS },
      { rank: 'A', stages: lanceA },
      { rank: 'B', stages: lanceB },
    ],
  },
  {
    id: 'javelin',
    name: '擲矛器',
    ranks: [
      { rank: 'S', stages: javelinS },
      { rank: 'A', stages: javelinA },
      { rank: 'B', stages: javelinB },
    ],
  },
  {
    id: 'knuckle',
    name: '拳套',
    ranks: [
      { rank: 'S', stages: knuckleS },
      { rank: 'A', stages: knuckleA },
      { rank: 'B', stages: knuckleB },
    ],
  },
  {
    id: 'bow',
    name: '弓',
    ranks: [
      { rank: 'S', stages: bowS },
      { rank: 'A', stages: bowA },
      { rank: 'B', stages: bowB },
    ],
  },
  {
    id: 'crossbow',
    name: '弩',
    ranks: [
      { rank: 'S', stages: crossbowS },
      { rank: 'A', stages: crossbowA },
      { rank: 'B', stages: crossbowB },
    ],
  },
  {
    id: 'one-hand-wand',
    name: '單手魔杖',
    ranks: [
      { rank: 'S', stages: oneHandWandS },
      { rank: 'A', stages: oneHandWandA },
      { rank: 'B', stages: oneHandWandB },
    ],
  },
  {
    id: 'staff',
    name: '集魔杖',
    ranks: [
      { rank: 'S', stages: staffS },
      { rank: 'A', stages: staffA },
      { rank: 'B', stages: staffB },
    ],
  },
  {
    id: 'bottle',
    name: '鋼瓶',
    ranks: [
      { rank: 'S', stages: bottleS },
      { rank: 'A', stages: bottleA },
      { rank: 'B', stages: bottleB },
    ],
  },
  {
    id: 'handle',
    name: '手把',
    ranks: [
      { rank: 'S', stages: handleS },
      { rank: 'A', stages: handleA },
      { rank: 'B', stages: handleB },
    ],
  },
  {
    id: 'dual-gun',
    name: '雙槍',
    ranks: [
      { rank: 'S', stages: dualGunS },
      { rank: 'A', stages: dualGunA },
      { rank: 'B', stages: dualGunB },
    ],
  },
  {
    id: 'shuriken',
    name: '手裏劍',
    ranks: [
      { rank: 'S', stages: shurikenS },
      { rank: 'A', stages: shurikenA },
      { rank: 'B', stages: shurikenB },
    ],
  },
  {
    id: 'chain-blade',
    name: '鎖鏈鏈刃',
    ranks: [
      { rank: 'S', stages: chainBladeS },
      { rank: 'A', stages: chainBladeA },
      { rank: 'B', stages: chainBladeB },
    ],
  },
];